In [1]:
import numpy as np

import pandas as pd

In [18]:
registrations = pd.DataFrame({ "reg_id" : [1,2,3,4]  , "name" : ["Andrew" , "Bobo" , "Claire" , "David"] } )

logins = pd.DataFrame(  {   "login_id" : [1,2,3,4] ,  "name" : ["Xavier" , "Andrew" , "Yolanda" , "Bobo"]  }  )

In [3]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [4]:
logins

   login_id     name
0         1   Xavier
1         2   Andrew
2         3  Yolanda
3         4     Bobo

In [5]:
pd.merge(registrations , logins , how = "outer" , on = "name")

   reg_id     name  login_id
0     1.0   Andrew       2.0
1     2.0     Bobo       4.0
2     3.0   Claire       NaN
3     4.0    David       NaN
4     NaN   Xavier       1.0
5     NaN  Yolanda       3.0

In [9]:
registrations = registrations.set_index("name")

In [10]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [12]:
pd.merge(registrations,logins,left_index= True,right_on="name",how = "inner")  #To join on index

   reg_id  login_id    name
1       1         2  Andrew
3       2         4    Bobo

In [22]:
registrations.reset_index(drop = True)

   index  reg_id    name
0      0       1  Andrew
1      1       2    Bobo
2      2       3  Claire
3      3       4   David

In [24]:
registrations.drop("index" , axis = 1 , inplace = True)

In [25]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [29]:
registrations.columns = ["reg_id" , "reg_name"]

In [30]:
registrations

   reg_id reg_name
0       1   Andrew
1       2     Bobo
2       3   Claire
3       4    David

In [32]:
result = pd.merge(registrations , logins, how = "inner" , left_on= "reg_name" , right_on= "name")

In [33]:
result

   reg_id reg_name  login_id    name
0       1   Andrew         2  Andrew
1       2     Bobo         4    Bobo

In [34]:
result.drop("name" , axis = 1)

   reg_id reg_name  login_id
0       1   Andrew         2
1       2     Bobo         4